app/controllers/cards_controller_controller.rb

  def show
    @cards = Card.all
---
SELECT "cards".* FROM "cards"