app/controllers/cards_controller.rb

  def create
    @card = Card.create(card_params)
---
INSERT INTO "cards" ("original_text", "translated_text", "review_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["original_text", "sometext22"], ["translated_text", "somtext2222"], ["review_date", "2016-03-19"], ["created_at", "2016-03-19 13:12:53.081363"], ["updated_at", "2016-03-19 13:12:53.081363"]]

  def show
    @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 24]]

  def edit
    @card = Card.find(params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 24]]

  def update
    @card = Card.find(params[:id])
    @card.update(card_params)
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 24]]
UPDATE "cards" SET "original_text" = $1, "translated_text" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["original_text", "somevalue444"], ["translated_text", "somevalue444"], ["updated_at", "2016-03-19 14:48:59.310720"], ["id", 24]]

  def destroy
    Card.destroy(params[:id])
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 25]]